{
    "cities": [
      {
        "name": "New Delhi",
        "distance_from_previous": 0,
        "weather": "Sunny",
        "degree_of_weather": "30°C",
        "image_url": "https://example.com/images/new_delhi.jpg",
        "description": "New Delhi is the capital city of India, rich in history and culture. It is known for its vibrant atmosphere and busy streets, offering a mix of modern and ancient landmarks. The city features iconic monuments such as India Gate, Qutub Minar, and the Red Fort. New Delhi also hosts several government institutions and embassies, making it the political heart of the country. Despite its busy urban life, New Delhi has lush green spaces like Lodi Gardens and the famous Humayun's Tomb. The city is also a food lover's paradise, offering both street food and fine dining options."
      },
      {
        "name": "Mumbai",
        "distance_from_previous": 1600,
        "weather": "Cloudy",
        "degree_of_weather": "28°C",
        "image_url": "https://example.com/images/mumbai.jpg",
        "description": "Mumbai, often referred to as the financial capital of India, is a fast-paced metropolis known for its diversity. It is home to the Bollywood film industry, famous for its colorful and glamorous lifestyle. Mumbai's iconic landmarks include the Gateway of India, Marine Drive, and the historic Chhatrapati Shivaji Maharaj Terminus. The city has a bustling nightlife, with numerous clubs, restaurants, and cultural events happening year-round. Despite its modernity, Mumbai has several historical sites, including the Elephanta Caves and the Chaupati beach. The weather tends to be humid, but the sea breeze brings a refreshing relief."
      },
      {
        "name": "Bengaluru",
        "distance_from_previous": 1800,
        "weather": "Partly Cloudy",
        "degree_of_weather": "24°C",
        "image_url": "https://example.com/images/bengaluru.jpg",
        "description": "Bengaluru, often known as the Silicon Valley of India, is the country’s leading tech hub. The city is home to numerous IT parks and multinational tech companies, attracting a global workforce. Bengaluru also offers a mix of old and new, with modern skyscrapers standing alongside centuries-old temples and gardens. The city's pleasant climate throughout the year makes it an ideal place for expatriates and tech professionals. Cubbon Park, Lalbagh Botanical Garden, and the Bangalore Palace are major attractions. Bengaluru is also known for its rich food culture, with everything from traditional South Indian dishes to contemporary international cuisine."
      },
      {
        "name": "Chennai",
        "distance_from_previous": 2100,
        "weather": "Rainy",
        "degree_of_weather": "32°C",
        "image_url": "https://example.com/images/chennai.jpg",
        "description": "Chennai, located on the southeastern coast of India, is a cultural and historical gem. It is known for its beautiful beaches like Marina Beach, and its ancient temples, including the Kapaleeshwarar Temple. The city has a thriving music and dance scene, particularly Carnatic music and Bharatanatyam dance. Chennai is also a significant center for classical art, literature, and Tamil cinema. The city’s weather is hot and humid for most of the year, with the monsoon bringing heavy rains. Despite its tropical climate, Chennai has numerous parks and green spaces, and it’s known for its rich culinary heritage, especially its famous idli, dosa, and sambar."
      },
      {
        "name": "Kolkata",
        "distance_from_previous": 1500,
        "weather": "Humid",
        "degree_of_weather": "34°C",
        "image_url": "https://example.com/images/kolkata.jpg",
        "description": "Kolkata, the cultural capital of India, is a city of contrasts, where colonial architecture meets traditional Indian charm. Known for its intellectual and artistic heritage, Kolkata has been home to many famous poets, artists, and Nobel laureates. The city’s landmarks include the Victoria Memorial, Howrah Bridge, and the bustling New Market. Kolkata is famous for its festivals, particularly Durga Puja, when the city comes alive with vibrant celebrations. It’s also known for its culinary delights, from Bengali sweets like rasgulla and sandesh to street food like puchkas and kathi rolls. The weather is humid, with long, hot summers and a monsoon season that brings heavy rains."
      },
      {
        "name": "Hyderabad",
        "distance_from_previous": 700,
        "weather": "Hot",
        "degree_of_weather": "38°C",
        "image_url": "https://example.com/images/hyderabad.jpg",
        "description": "Hyderabad is a city of historical significance, known for its rich blend of Mughal and Telugu cultures. Famous for its iconic Charminar and the imposing Golconda Fort, Hyderabad is also a hub for technology and innovation. The city is home to HITEC City, one of India’s largest tech parks, and is a global center for IT services. Hyderabad is equally renowned for its culinary heritage, especially the world-famous Hyderabadi Biryani. The weather in Hyderabad is typically hot and dry, but the city’s numerous lakes, such as Hussain Sagar, provide a cooling effect. The old city’s narrow lanes, vibrant markets, and traditional crafts provide a stark contrast to its modern skyline."
      },
      {
        "name": "Jaipur",
        "distance_from_previous": 300,
        "weather": "Clear",
        "degree_of_weather": "35°C",
        "image_url": "https://example.com/images/jaipur.jpg",
        "description": "Jaipur, the capital of Rajasthan, is famously known as the 'Pink City' due to its unique architecture, with most buildings painted in a shade of pink. The city is a fusion of royal palaces, historic forts, and vibrant markets. Key attractions include the Amer Fort, City Palace, Hawa Mahal, and the Jantar Mantar observatory. Jaipur is also a great place to experience Rajasthani culture, from its traditional folk music and dance to its colorful handicrafts. The weather in Jaipur can be quite hot during the summer, but it has a relatively cooler and pleasant climate during the winter months. Jaipur is famous for its festivals, including the grand Elephant Festival and Teej."
      },
      {
        "name": "Pune",
        "distance_from_previous": 150,
        "weather": "Pleasant",
        "degree_of_weather": "26°C",
        "image_url": "https://example.com/images/pune.jpg",
        "description": "Pune, often referred to as the 'Oxford of the East', is a city known for its vibrant student life and rich cultural heritage. It is home to numerous educational institutions, research centers, and universities. The city offers a pleasant climate, especially during the monsoon and winter months, which makes it a popular choice for both locals and expats. Pune has a mix of modern infrastructure and old-world charm, with historical sites like the Aga Khan Palace, Shaniwar Wada, and the Osho Ashram. It is also known for its thriving food scene, offering a wide range of street food, traditional Maharashtrian dishes, and modern cafes."
      },
      {
        "name": "Ahmedabad",
        "distance_from_previous": 500,
        "weather": "Hot",
        "degree_of_weather": "40°C",
        "image_url": "https://example.com/images/ahmedabad.jpg",
        "description": "Ahmedabad, the largest city in Gujarat, is a vibrant blend of tradition and modernity. Known for its textile industry, Ahmedabad is also home to several historic monuments, including the Sabarmati Ashram, the former residence of Mahatma Gandhi, and the Sidi Saiyyed Mosque, famous for its intricate jali work. The city’s rich cultural history can be explored through its numerous museums, art galleries, and craft markets. Ahmedabad’s food scene is famous for its snacks like fafda, dhokla, and the iconic Gujarati thali. The weather is typically hot and dry, especially during the summer, but the winters are pleasant and ideal for outdoor activities."
      }
    ]
  }
  